Revit 2026 API

# WallWallType Property

---

Retrieves or changes the type of the wall.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WallType WallType { get; set; }
```
```vb
Public Property WallType As WallType
	Get
	Set
```
```cpp
public:
property WallType^ WallType {
	WallType^ get ();
	void set (WallType^ value);
}
```
```fsharp
member WallType : WallType with get, set
```

#### Property Value

WallType The type of the wall.

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The wall type wallType is not valid for the current wall. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The WallType property can be used to retrieve the kind of the wall. This property can also be used to change the type of a wall by setting it to a different wall type. All the wall types in the project can be found using the Document.WallTypes property.

#### Reference

Wall Class

Autodesk.Revit.DB Namespace